
#### Terraform Plan Validate All 📖`success`

<details><summary>Show Plan</summary>

```

.github/workflows doesn't match ^(development|non-production|production|shared)$; skipping
*************** TERRAFORM INIT *******************
      At environment: envs/shared 
**************************************************
[command]/home/runner/work/_temp/9b93bf7f-6c07-4b18-b095-9cf9ef2e1207/terraform-bin init -no-color

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- bootstrap_projects_remove_editor in modules/parent-iam-remove-role
- cicd_project_iam_member in modules/parent-iam-member
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 12.0.0 for gh_cicd...
- gh_cicd in .terraform/modules/gh_cicd
- gh_cicd.budget in .terraform/modules/gh_cicd/modules/budget
- gh_cicd.essential_contacts in .terraform/modules/gh_cicd/modules/essential_contacts
- gh_cicd.gsuite_group in .terraform/modules/gh_cicd/modules/gsuite_group
- gh_cicd.project-factory in .terraform/modules/gh_cicd/modules/core_project_factory
- gh_cicd.project-factory.project_services in .terraform/modules/gh_cicd/modules/project_services
- gh_cicd.quotas in .terraform/modules/gh_cicd/modules/quota_manager
- gh_cicd.shared_vpc_access in .terraform/modules/gh_cicd/modules/shared_vpc_access
Downloading registry.terraform.io/terraform-google-modules/github-actions-runners/google 3.1.2 for gh_oidc...
- gh_oidc in .terraform/modules/gh_oidc/modules/gh-oidc
Downloading registry.terraform.io/terraform-google-modules/group/google 0.6.1 for optional_group...
- optional_group in .terraform/modules/optional_group
- org_iam_member in modules/parent-iam-member
- parent_iam_member in modules/parent-iam-member
Downloading registry.terraform.io/terraform-google-modules/group/google 0.6.1 for required_group...
- required_group in .terraform/modules/required_group
Downloading registry.terraform.io/terraform-google-modules/bootstrap/google 7.1.0 for seed_bootstrap...
- seed_bootstrap in .terraform/modules/seed_bootstrap
Downloading registry.terraform.io/terraform-google-modules/org-policy/google 5.3.0 for seed_bootstrap.enable_cross_project_service_account_usage...
- seed_bootstrap.enable_cross_project_service_account_usage in .terraform/modules/seed_bootstrap.enable_cross_project_service_account_usage
Downloading registry.terraform.io/terraform-google-modules/kms/google 2.3.0 for seed_bootstrap.kms...
- seed_bootstrap.kms in .terraform/modules/seed_bootstrap.kms
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 14.5.0 for seed_bootstrap.seed_project...
- seed_bootstrap.seed_project in .terraform/modules/seed_bootstrap.seed_project
- seed_bootstrap.seed_project.budget in .terraform/modules/seed_bootstrap.seed_project/modules/budget
- seed_bootstrap.seed_project.essential_contacts in .terraform/modules/seed_bootstrap.seed_project/modules/essential_contacts
- seed_bootstrap.seed_project.gsuite_group in .terraform/modules/seed_bootstrap.seed_project/modules/gsuite_group
- seed_bootstrap.seed_project.project-factory in .terraform/modules/seed_bootstrap.seed_project/modules/core_project_factory
- seed_bootstrap.seed_project.project-factory.project_services in .terraform/modules/seed_bootstrap.seed_project/modules/project_services
- seed_bootstrap.seed_project.quotas in .terraform/modules/seed_bootstrap.seed_project/modules/quota_manager
- seed_bootstrap.seed_project.shared_vpc_access in .terraform/modules/seed_bootstrap.seed_project/modules/shared_vpc_access
- seed_project_iam_member in modules/parent-iam-member

Initializing provider plugins...
- Reusing previous version of hashicorp/google-beta from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of hashicorp/null from the dependency lock file
- Reusing previous version of hashicorp/time from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of hashicorp/google from the dependency lock file
- Installing hashicorp/null v3.2.2...
- Installed hashicorp/null v3.2.2 (signed by HashiCorp)
- Installing hashicorp/time v0.11.1...
- Installed hashicorp/time v0.11.1 (signed by HashiCorp)
- Installing integrations/github v5.34.0...
- Installed integrations/github v5.34.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing hashicorp/google v4.84.0...
- Installed hashicorp/google v4.84.0 (signed by HashiCorp)
- Installing hashicorp/google-beta v4.84.0...
- Installed hashicorp/google-beta v4.84.0 (signed by HashiCorp)
- Installing hashicorp/random v3.6.0...
- Installed hashicorp/random v3.6.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!
::debug::Terraform exited with code 0.
::debug::stdout: %0AInitializing the backend...%0A%0ASuccessfully configured the backend "gcs"! Terraform will automatically%0Ause this backend unless the backend configuration changes.%0AInitializing modules...%0A- bootstrap_projects_remove_editor in modules/parent-iam-remove-role%0A- cicd_project_iam_member in modules/parent-iam-member%0ADownloading registry.terraform.io/terraform-google-modules/project-factory/google 12.0.0 for gh_cicd...%0A- gh_cicd in .terraform/modules/gh_cicd%0A- gh_cicd.budget in .terraform/modules/gh_cicd/modules/budget%0A- gh_cicd.essential_contacts in .terraform/modules/gh_cicd/modules/essential_contacts%0A- gh_cicd.gsuite_group in .terraform/modules/gh_cicd/modules/gsuite_group%0A- gh_cicd.project-factory in .terraform/modules/gh_cicd/modules/core_project_factory%0A- gh_cicd.project-factory.project_services in .terraform/modules/gh_cicd/modules/project_services%0A- gh_cicd.quotas in .terraform/modules/gh_cicd/modules/quota_manager%0A- gh_cicd.shared_vpc_access in .terraform/modules/gh_cicd/modules/shared_vpc_access%0ADownloading registry.terraform.io/terraform-google-modules/github-actions-runners/google 3.1.2 for gh_oidc...%0A- gh_oidc in .terraform/modules/gh_oidc/modules/gh-oidc%0ADownloading registry.terraform.io/terraform-google-modules/group/google 0.6.1 for optional_group...%0A- optional_group in .terraform/modules/optional_group%0A- org_iam_member in modules/parent-iam-member%0A- parent_iam_member in modules/parent-iam-member%0ADownloading registry.terraform.io/terraform-google-modules/group/google 0.6.1 for required_group...%0A- required_group in .terraform/modules/required_group%0ADownloading registry.terraform.io/terraform-google-modules/bootstrap/google 7.1.0 for seed_bootstrap...%0A- seed_bootstrap in .terraform/modules/seed_bootstrap%0ADownloading registry.terraform.io/terraform-google-modules/org-policy/google 5.3.0 for seed_bootstrap.enable_cross_project_service_account_usage...%0A- seed_bootstrap.enable_cross_project_service_account_usage in .terraform/modules/seed_bootstrap.enable_cross_project_service_account_usage%0ADownloading registry.terraform.io/terraform-google-modules/kms/google 2.3.0 for seed_bootstrap.kms...%0A- seed_bootstrap.kms in .terraform/modules/seed_bootstrap.kms%0ADownloading registry.terraform.io/terraform-google-modules/project-factory/google 14.5.0 for seed_bootstrap.seed_project...%0A- seed_bootstrap.seed_project in .terraform/modules/seed_bootstrap.seed_project%0A- seed_bootstrap.seed_project.budget in .terraform/modules/seed_bootstrap.seed_project/modules/budget%0A- seed_bootstrap.seed_project.essential_contacts in .terraform/modules/seed_bootstrap.seed_project/modules/essential_contacts%0A- seed_bootstrap.seed_project.gsuite_group in .terraform/modules/seed_bootstrap.seed_project/modules/gsuite_group%0A- seed_bootstrap.seed_project.project-factory in .terraform/modules/seed_bootstrap.seed_project/modules/core_project_factory%0A- seed_bootstrap.seed_project.project-factory.project_services in .terraform/modules/seed_bootstrap.seed_project/modules/project_services%0A- seed_bootstrap.seed_project.quotas in .terraform/modules/seed_bootstrap.seed_project/modules/quota_manager%0A- seed_bootstrap.seed_project.shared_vpc_access in .terraform/modules/seed_bootstrap.seed_project/modules/shared_vpc_access%0A- seed_project_iam_member in modules/parent-iam-member%0A%0AInitializing provider plugins...%0A- Reusing previous version of hashicorp/google-beta from the dependency lock file%0A- Reusing previous version of hashicorp/random from the dependency lock file%0A- Reusing previous version of hashicorp/null from the dependency lock file%0A- Reusing previous version of hashicorp/time from the dependency lock file%0A- Reusing previous version of integrations/github from the dependency lock file%0A- Reusing previous version of hashicorp/google from the dependency lock file%0A- Installing hashicorp/null v3.2.2...%0A- Installed hashicorp/null v3.2.2 (signed by HashiCorp)%0A- Installing hashicorp/time v0.11.1...%0A- Installed hashicorp/time v0.11.1 (signed by HashiCorp)%0A- Installing integrations/github v5.34.0...%0A- Installed integrations/github v5.34.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)%0A- Installing hashicorp/google v4.84.0...%0A- Installed hashicorp/google v4.84.0 (signed by HashiCorp)%0A- Installing hashicorp/google-beta v4.84.0...%0A- Installed hashicorp/google-beta v4.84.0 (signed by HashiCorp)%0A- Installing hashicorp/random v3.6.0...%0A- Installed hashicorp/random v3.6.0 (signed by HashiCorp)%0A%0APartner and community providers are signed by their developers.%0AIf you'd like to know more about provider signing, you can read about it here:%0Ahttps://www.terraform.io/docs/cli/plugins/signing.html%0A%0ATerraform has been successfully initialized!%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0AInitializing the backend...%0A%0ASuccessfully configured the backend "gcs"! Terraform will automatically%0Ause this backend unless the backend configuration changes.%0AInitializing modules...%0A- bootstrap_projects_remove_editor in modules/parent-iam-remove-role%0A- cicd_project_iam_member in modules/parent-iam-member%0ADownloading registry.terraform.io/terraform-google-modules/project-factory/google 12.0.0 for gh_cicd...%0A- gh_cicd in .terraform/modules/gh_cicd%0A- gh_cicd.budget in .terraform/modules/gh_cicd/modules/budget%0A- gh_cicd.essential_contacts in .terraform/modules/gh_cicd/modules/essential_contacts%0A- gh_cicd.gsuite_group in .terraform/modules/gh_cicd/modules/gsuite_group%0A- gh_cicd.project-factory in .terraform/modules/gh_cicd/modules/core_project_factory%0A- gh_cicd.project-factory.project_services in .terraform/modules/gh_cicd/modules/project_services%0A- gh_cicd.quotas in .terraform/modules/gh_cicd/modules/quota_manager%0A- gh_cicd.shared_vpc_access in .terraform/modules/gh_cicd/modules/shared_vpc_access%0ADownloading registry.terraform.io/terraform-google-modules/github-actions-runners/google 3.1.2 for gh_oidc...%0A- gh_oidc in .terraform/modules/gh_oidc/modules/gh-oidc%0ADownloading registry.terraform.io/terraform-google-modules/group/google 0.6.1 for optional_group...%0A- optional_group in .terraform/modules/optional_group%0A- org_iam_member in modules/parent-iam-member%0A- parent_iam_member in modules/parent-iam-member%0ADownloading registry.terraform.io/terraform-google-modules/group/google 0.6.1 for required_group...%0A- required_group in .terraform/modules/required_group%0ADownloading registry.terraform.io/terraform-google-modules/bootstrap/google 7.1.0 for seed_bootstrap...%0A- seed_bootstrap in .terraform/modules/seed_bootstrap%0ADownloading registry.terraform.io/terraform-google-modules/org-policy/google 5.3.0 for seed_bootstrap.enable_cross_project_service_account_usage...%0A- seed_bootstrap.enable_cross_project_service_account_usage in .terraform/modules/seed_bootstrap.enable_cross_project_service_account_usage%0ADownloading registry.terraform.io/terraform-google-modules/kms/google 2.3.0 for seed_bootstrap.kms...%0A- seed_bootstrap.kms in .terraform/modules/seed_bootstrap.kms%0ADownloading registry.terraform.io/terraform-google-modules/project-factory/google 14.5.0 for seed_bootstrap.seed_project...%0A- seed_bootstrap.seed_project in .terraform/modules/seed_bootstrap.seed_project%0A- seed_bootstrap.seed_project.budget in .terraform/modules/seed_bootstrap.seed_project/modules/budget%0A- seed_bootstrap.seed_project.essential_contacts in .terraform/modules/seed_bootstrap.seed_project/modules/essential_contacts%0A- seed_bootstrap.seed_project.gsuite_group in .terraform/modules/seed_bootstrap.seed_project/modules/gsuite_group%0A- seed_bootstrap.seed_project.project-factory in .terraform/modules/seed_bootstrap.seed_project/modules/core_project_factory%0A- seed_bootstrap.seed_project.project-factory.project_services in .terraform/modules/seed_bootstrap.seed_project/modules/project_services%0A- seed_bootstrap.seed_project.quotas in .terraform/modules/seed_bootstrap.seed_project/modules/quota_manager%0A- seed_bootstrap.seed_project.shared_vpc_access in .terraform/modules/seed_bootstrap.seed_project/modules/shared_vpc_access%0A- seed_project_iam_member in modules/parent-iam-member%0A%0AInitializing provider plugins...%0A- Reusing previous version of hashicorp/google-beta from the dependency lock file%0A- Reusing previous version of hashicorp/random from the dependency lock file%0A- Reusing previous version of hashicorp/null from the dependency lock file%0A- Reusing previous version of hashicorp/time from the dependency lock file%0A- Reusing previous version of integrations/github from the dependency lock file%0A- Reusing previous version of hashicorp/google from the dependency lock file%0A- Installing hashicorp/null v3.2.2...%0A- Installed hashicorp/null v3.2.2 (signed by HashiCorp)%0A- Installing hashicorp/time v0.11.1...%0A- Installed hashicorp/time v0.11.1 (signed by HashiCorp)%0A- Installing integrations/github v5.34.0...%0A- Installed integrations/github v5.34.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)%0A- Installing hashicorp/google v4.84.0...%0A- Installed hashicorp/google v4.84.0 (signed by HashiCorp)%0A- Installing hashicorp/google-beta v4.84.0...%0A- Installed hashicorp/google-beta v4.84.0 (signed by HashiCorp)%0A- Installing hashicorp/random v3.6.0...%0A- Installed hashicorp/random v3.6.0 (signed by HashiCorp)%0A%0APartner and community providers are signed by their developers.%0AIf you'd like to know more about provider signing, you can read about it here:%0Ahttps://www.terraform.io/docs/cli/plugins/signing.html%0A%0ATerraform has been successfully initialized!%0A

::set-output name=stderr::

::set-output name=exitcode::0
*************** TERRAFORM PLAN *******************
      At environment: envs/shared 
**************************************************
[command]/home/runner/work/_temp/9b93bf7f-6c07-4b18-b095-9cf9ef2e1207/terraform-bin plan -no-color -input=false -out /home/runner/work/VXI-Bootstrap/VXI-Bootstrap/tmp_plan/envs-shared.tfplan
module.seed_bootstrap.module.seed_project.module.project-factory.random_id.random_project_id_suffix: Refreshing state... [id=Nlw]
module.gh_cicd.module.project-factory.random_id.random_project_id_suffix: Refreshing state... [id=9U4]
module.seed_bootstrap.random_id.suffix: Refreshing state... [id=Gic]
google_folder.bootstrap: Refreshing state... [id=folders/960529958502]
module.seed_bootstrap.google_organization_iam_member.org_admins_group["roles/billing.user"]: Refreshing state... [id=1078592434138/roles/billing.user/group:gcp-organization-admins@inlzgke1.joonix.net]
module.seed_bootstrap.google_organization_iam_binding.billing_creator: Refreshing state... [id=1078592434138/roles/billing.creator]
module.seed_bootstrap.google_organization_iam_member.org_billing_admin: Refreshing state... [id=1078592434138/roles/billing.admin/group:gcp-billing-admins@inlzgke1.joonix.net]
module.seed_bootstrap.google_organization_iam_member.org_admins_group["roles/resourcemanager.organizationAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.organizationAdmin/group:gcp-organization-admins@inlzgke1.joonix.net]
module.seed_bootstrap.google_organization_iam_member.org_admin_serviceusage_consumer[0]: Refreshing state... [id=1078592434138/roles/serviceusage.serviceUsageConsumer/group:gcp-organization-admins@inlzgke1.joonix.net]
module.seed_bootstrap.google_organization_iam_member.tmp_project_creator[0]: Refreshing state... [id=1078592434138/roles/resourcemanager.projectCreator/group:gcp-organization-admins@inlzgke1.joonix.net]
module.gh_cicd.module.project-factory.google_project.main: Refreshing state... [id=projects/prj-b-cicd-wif-gh-f54e]
module.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/serviceusage.googleapis.com]
module.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/compute.googleapis.com]
module.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/billingbudgets.googleapis.com]
module.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["admin.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/admin.googleapis.com]
module.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/cloudresourcemanager.googleapis.com]
module.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/iamcredentials.googleapis.com]
module.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["cloudbilling.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/cloudbilling.googleapis.com]
module.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/iam.googleapis.com]
module.gh_cicd.module.project-factory.google_service_account.default_service_account[0]: Refreshing state... [id=projects/prj-b-cicd-wif-gh-f54e/serviceAccounts/project-service-account@prj-b-cicd-wif-gh-f54e.iam.gserviceaccount.com]
module.seed_bootstrap.module.seed_project.module.project-factory.google_project.main: Refreshing state... [id=projects/prj-b-seed-365c]
module.seed_bootstrap.module.seed_project.module.project-factory.google_resource_manager_lien.lien[0]: Refreshing state... [id=p725595940612-la06c2b9e-ba2b-4986-95fd-c3f04e2cca09]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["essentialcontacts.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/essentialcontacts.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/compute.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/monitoring.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/iamcredentials.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/servicenetworking.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["accesscontextmanager.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/accesscontextmanager.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/cloudresourcemanager.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/billingbudgets.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/iam.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["securitycenter.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/securitycenter.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudasset.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/cloudasset.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["assuredworkloads.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/assuredworkloads.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/serviceusage.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["appengine.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/appengine.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["storage-api.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/storage-api.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["admin.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/admin.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/cloudbuild.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/logging.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["pubsub.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/pubsub.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/bigquery.googleapis.com]
module.gh_cicd.module.project-factory.google_project_default_service_accounts.default_service_accounts[0]: Refreshing state... [id=projects/prj-b-cicd-wif-gh-f54e]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/cloudkms.googleapis.com]
module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudbilling.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/cloudbilling.googleapis.com]
module.gh_cicd.module.budget.data.google_project.project[0]: Reading...
module.gh_oidc.google_iam_workload_identity_pool.main: Refreshing state... [id=projects/prj-b-cicd-wif-gh-f54e/locations/global/workloadIdentityPools/foundation-pool]
module.gh_cicd.module.budget.data.google_project.project[0]: Read complete after 1s [id=projects/prj-b-cicd-wif-gh-f54e]
module.gh_oidc.google_iam_workload_identity_pool_provider.main: Refreshing state... [id=projects/prj-b-cicd-wif-gh-f54e/locations/global/workloadIdentityPools/foundation-pool/providers/foundation-gh-provider]
module.seed_bootstrap.module.seed_project.module.project-factory.google_project_default_service_accounts.default_service_accounts[0]: Refreshing state... [id=projects/prj-b-seed-365c]
module.seed_bootstrap.module.kms[0].google_kms_key_ring.key_ring: Refreshing state... [id=projects/prj-b-seed-365c/locations/us-central1/keyRings/prj-keyring]
module.seed_bootstrap.module.enable_cross_project_service_account_usage.google_project_organization_policy.project_policy_boolean[0]: Refreshing state... [id=prj-b-seed-365c:constraints/iam.disableCrossProjectServiceAccountUsage]
google_service_account.terraform-env-sa["env"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account.terraform-env-sa["proj"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account.terraform-env-sa["bootstrap"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account.terraform-env-sa["org"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account.terraform-env-sa["net"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account_iam_member.self_impersonate["bootstrap"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account_iam_member.self_impersonate["org"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account_iam_member.self_impersonate["env"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account_iam_member.self_impersonate["net"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
google_service_account_iam_member.self_impersonate["proj"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/iam.workloadIdentityPoolAdmin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/workflows.admin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/workflows.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/dns.admin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/dns.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/cloudbuild.builds.editor"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/cloudbuild.builds.editor/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/resourcemanager.projectDeleter"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/resourcemanager.projectDeleter/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/compute.networkAdmin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/compute.networkAdmin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/cloudscheduler.admin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/cloudscheduler.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/artifactregistry.admin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/artifactregistry.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/iam.serviceAccountAdmin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/storage.admin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/storage.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/cloudbuild.workerPoolOwner"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/cloudbuild.workerPoolOwner/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.cicd_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/source.admin"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/source.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_bootstrap.module.kms[0].google_kms_crypto_key.key[0]: Refreshing state... [id=projects/prj-b-seed-365c/locations/us-central1/keyRings/prj-keyring/cryptoKeys/prj-key]
module.gh_oidc.google_service_account_iam_member.wif-sa["env"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/893006554401/locations/global/workloadIdentityPools/foundation-pool/attribute.repository/rishabh1dhakar/VXI-env]
module.gh_oidc.google_service_account_iam_member.wif-sa["bootstrap"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/893006554401/locations/global/workloadIdentityPools/foundation-pool/attribute.repository/rishabh1dhakar/VXI-Bootstrap]
module.gh_oidc.google_service_account_iam_member.wif-sa["org"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/893006554401/locations/global/workloadIdentityPools/foundation-pool/attribute.repository/rishabh1dhakar/VXI-Org]
module.gh_oidc.google_service_account_iam_member.wif-sa["net"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/893006554401/locations/global/workloadIdentityPools/foundation-pool/attribute.repository/rishabh1dhakar/VXI-Network]
module.gh_oidc.google_service_account_iam_member.wif-sa["proj"]: Refreshing state... [id=projects/prj-b-seed-365c/serviceAccounts/sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/893006554401/locations/global/workloadIdentityPools/foundation-pool/attribute.repository/rishabh1dhakar/VXI-Projects]
module.parent_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.folderViewer"]: Refreshing state... [id=1078592434138/roles/resourcemanager.folderViewer/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["proj"].google_organization_iam_member.org_parent_iam["roles/compute.xpnAdmin"]: Refreshing state... [id=1078592434138/roles/compute.xpnAdmin/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["proj"].google_organization_iam_member.org_parent_iam["roles/compute.networkAdmin"]: Refreshing state... [id=1078592434138/roles/compute.networkAdmin/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/dns.admin"]: Refreshing state... [id=1078592434138/roles/dns.admin/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["proj"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.folderAdmin/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.folderAdmin/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["bootstrap"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.folderAdmin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/compute.orgSecurityPolicyAdmin"]: Refreshing state... [id=1078592434138/roles/compute.orgSecurityPolicyAdmin/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/compute.networkAdmin"]: Refreshing state... [id=1078592434138/roles/compute.networkAdmin/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["env"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.folderAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.folderAdmin/serviceAccount:sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/compute.orgSecurityResourceAdmin"]: Refreshing state... [id=1078592434138/roles/compute.orgSecurityResourceAdmin/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["proj"].google_organization_iam_member.org_parent_iam["roles/artifactregistry.admin"]: Refreshing state... [id=1078592434138/roles/artifactregistry.admin/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.parent_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/compute.securityAdmin"]: Refreshing state... [id=1078592434138/roles/compute.securityAdmin/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/browser"]: Refreshing state... [id=1078592434138/roles/browser/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["bootstrap"].google_organization_iam_member.org_parent_iam["roles/browser"]: Refreshing state... [id=1078592434138/roles/browser/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["proj"].google_organization_iam_member.org_parent_iam["roles/browser"]: Refreshing state... [id=1078592434138/roles/browser/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["proj"].google_organization_iam_member.org_parent_iam["roles/accesscontextmanager.policyAdmin"]: Refreshing state... [id=1078592434138/roles/accesscontextmanager.policyAdmin/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["bootstrap"].google_organization_iam_member.org_parent_iam["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=1078592434138/roles/serviceusage.serviceUsageConsumer/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["proj"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.organizationAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.organizationAdmin/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.organizationAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.organizationAdmin/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["env"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.tagUser"]: Refreshing state... [id=1078592434138/roles/resourcemanager.tagUser/serviceAccount:sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/orgpolicy.policyAdmin"]: Refreshing state... [id=1078592434138/roles/orgpolicy.policyAdmin/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.organizationViewer"]: Refreshing state... [id=1078592434138/roles/resourcemanager.organizationViewer/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/securitycenter.sourcesEditor"]: Refreshing state... [id=1078592434138/roles/securitycenter.sourcesEditor/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/essentialcontacts.admin"]: Refreshing state... [id=1078592434138/roles/essentialcontacts.admin/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/compute.xpnAdmin"]: Refreshing state... [id=1078592434138/roles/compute.xpnAdmin/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["env"].google_organization_iam_member.org_parent_iam["roles/browser"]: Refreshing state... [id=1078592434138/roles/browser/serviceAccount:sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["bootstrap"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.organizationAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.organizationAdmin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["net"].google_organization_iam_member.org_parent_iam["roles/accesscontextmanager.policyAdmin"]: Refreshing state... [id=1078592434138/roles/accesscontextmanager.policyAdmin/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["proj"].google_organization_iam_member.org_parent_iam["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=1078592434138/roles/serviceusage.serviceUsageConsumer/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["env"].google_organization_iam_member.org_parent_iam["roles/assuredworkloads.admin"]: Refreshing state... [id=1078592434138/roles/assuredworkloads.admin/serviceAccount:sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/cloudasset.owner"]: Refreshing state... [id=1078592434138/roles/cloudasset.owner/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["bootstrap"].google_organization_iam_member.org_parent_iam["roles/accesscontextmanager.policyAdmin"]: Refreshing state... [id=1078592434138/roles/accesscontextmanager.policyAdmin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/accesscontextmanager.policyAdmin"]: Refreshing state... [id=1078592434138/roles/accesscontextmanager.policyAdmin/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/securitycenter.notificationConfigEditor"]: Refreshing state... [id=1078592434138/roles/securitycenter.notificationConfigEditor/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/browser"]: Refreshing state... [id=1078592434138/roles/browser/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.tagUser"]: Refreshing state... [id=1078592434138/roles/resourcemanager.tagUser/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/resourcemanager.tagAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.tagAdmin/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.org_iam_member["org"].google_organization_iam_member.org_parent_iam["roles/logging.configWriter"]: Refreshing state... [id=1078592434138/roles/logging.configWriter/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_project_iam_member["env"].google_project_iam_member.project_parent_iam["roles/storage.objectAdmin"]: Refreshing state... [id=prj-b-seed-365c/roles/storage.objectAdmin/serviceAccount:sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=prj-b-seed-365c/roles/iam.serviceAccountAdmin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/storage.admin"]: Refreshing state... [id=prj-b-seed-365c/roles/storage.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_project_iam_member["net"].google_project_iam_member.project_parent_iam["roles/storage.objectAdmin"]: Refreshing state... [id=prj-b-seed-365c/roles/storage.objectAdmin/serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_project_iam_member["org"].google_project_iam_member.project_parent_iam["roles/storage.objectAdmin"]: Refreshing state... [id=prj-b-seed-365c/roles/storage.objectAdmin/serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/cloudkms.admin"]: Refreshing state... [id=prj-b-seed-365c/roles/cloudkms.admin/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_project_iam_member["bootstrap"].google_project_iam_member.project_parent_iam["roles/resourcemanager.projectDeleter"]: Refreshing state... [id=prj-b-seed-365c/roles/resourcemanager.projectDeleter/serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_project_iam_member["proj"].google_project_iam_member.project_parent_iam["roles/storage.objectAdmin"]: Refreshing state... [id=prj-b-seed-365c/roles/storage.objectAdmin/serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com]
module.seed_bootstrap.module.kms[0].google_kms_crypto_key_iam_binding.decrypters[0]: Refreshing state... [id=projects/prj-b-seed-365c/locations/us-central1/keyRings/prj-keyring/cryptoKeys/prj-key/roles/cloudkms.cryptoKeyDecrypter]
module.seed_bootstrap.module.kms[0].google_kms_crypto_key_iam_binding.encrypters[0]: Refreshing state... [id=projects/prj-b-seed-365c/locations/us-central1/keyRings/prj-keyring/cryptoKeys/prj-key/roles/cloudkms.cryptoKeyEncrypter]
module.seed_bootstrap.google_organization_iam_binding.project_creator[0]: Refreshing state... [id=1078592434138/roles/resourcemanager.projectCreator]
module.seed_bootstrap.google_storage_bucket.org_terraform_state: Refreshing state... [id=bkt-prj-b-seed-tfstate-1a27]
module.seed_bootstrap.google_storage_bucket_iam_member.orgadmins_state_iam[0]: Refreshing state... [id=b/bkt-prj-b-seed-tfstate-1a27/roles/storage.admin/group:gcp-organization-admins@inlzgke1.joonix.net]
github_actions_secret.secrets["env.WIF_PROVIDER_NAME"]: Refreshing state... [id=VXI-env:WIF_PROVIDER_NAME]
github_actions_secret.secrets["proj.TF_BACKEND"]: Refreshing state... [id=VXI-Projects:TF_BACKEND]
github_actions_secret.secrets["net.SERVICE_ACCOUNT_EMAIL"]: Refreshing state... [id=VXI-Network:SERVICE_ACCOUNT_EMAIL]
github_actions_secret.secrets["bootstrap.PROJECT_ID"]: Refreshing state... [id=VXI-Bootstrap:PROJECT_ID]
github_actions_secret.secrets["org.SERVICE_ACCOUNT_EMAIL"]: Refreshing state... [id=VXI-Org:SERVICE_ACCOUNT_EMAIL]
github_actions_secret.secrets["org.TF_VAR_gh_token"]: Refreshing state... [id=VXI-Org:TF_VAR_gh_token]
github_actions_secret.secrets["proj.WIF_PROVIDER_NAME"]: Refreshing state... [id=VXI-Projects:WIF_PROVIDER_NAME]
github_actions_secret.secrets["bootstrap.TF_VAR_gh_token"]: Refreshing state... [id=VXI-Bootstrap:TF_VAR_gh_token]
github_actions_secret.secrets["proj.SERVICE_ACCOUNT_EMAIL"]: Refreshing state... [id=VXI-Projects:SERVICE_ACCOUNT_EMAIL]
github_actions_secret.secrets["org.WIF_PROVIDER_NAME"]: Refreshing state... [id=VXI-Org:WIF_PROVIDER_NAME]
github_actions_secret.secrets["net.PROJECT_ID"]: Refreshing state... [id=VXI-Network:PROJECT_ID]
github_actions_secret.secrets["org.PROJECT_ID"]: Refreshing state... [id=VXI-Org:PROJECT_ID]
github_actions_secret.secrets["bootstrap.TF_BACKEND"]: Refreshing state... [id=VXI-Bootstrap:TF_BACKEND]
github_actions_secret.secrets["env.PROJECT_ID"]: Refreshing state... [id=VXI-env:PROJECT_ID]
github_actions_secret.secrets["org.TF_BACKEND"]: Refreshing state... [id=VXI-Org:TF_BACKEND]
github_actions_secret.secrets["env.SERVICE_ACCOUNT_EMAIL"]: Refreshing state... [id=VXI-env:SERVICE_ACCOUNT_EMAIL]
github_actions_secret.secrets["net.WIF_PROVIDER_NAME"]: Refreshing state... [id=VXI-Network:WIF_PROVIDER_NAME]
github_actions_secret.secrets["bootstrap.SERVICE_ACCOUNT_EMAIL"]: Refreshing state... [id=VXI-Bootstrap:SERVICE_ACCOUNT_EMAIL]
github_actions_secret.secrets["bootstrap.WIF_PROVIDER_NAME"]: Refreshing state... [id=VXI-Bootstrap:WIF_PROVIDER_NAME]
github_actions_secret.secrets["net.TF_VAR_gh_token"]: Refreshing state... [id=VXI-Network:TF_VAR_gh_token]
github_actions_secret.secrets["env.TF_BACKEND"]: Refreshing state... [id=VXI-env:TF_BACKEND]
github_actions_secret.secrets["net.TF_BACKEND"]: Refreshing state... [id=VXI-Network:TF_BACKEND]
github_actions_secret.secrets["env.TF_VAR_gh_token"]: Refreshing state... [id=VXI-env:TF_VAR_gh_token]
github_actions_secret.secrets["proj.TF_VAR_gh_token"]: Refreshing state... [id=VXI-Projects:TF_VAR_gh_token]
github_actions_secret.secrets["proj.PROJECT_ID"]: Refreshing state... [id=VXI-Projects:PROJECT_ID]
module.bootstrap_projects_remove_editor["seed"].google_project_iam_binding.iam_remove["roles/editor"]: Refreshing state... [id=prj-b-seed-365c/roles/editor]
module.bootstrap_projects_remove_editor["cicd"].google_project_iam_binding.iam_remove["roles/editor"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/roles/editor]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.seed_bootstrap.google_organization_iam_member.tmp_project_creator[0] has been deleted
  - resource "google_organization_iam_member" "tmp_project_creator" {
        id     = "1078592434138/roles/resourcemanager.projectCreator/group:gcp-organization-admins@inlzgke1.joonix.net"
      - org_id = "1078592434138" -> null
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # github_actions_secret.secrets["bootstrap.TF_VAR_gh_token"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "VXI-Bootstrap"
      + secret_name     = "TF_VAR_gh_token"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.secrets["env.TF_VAR_gh_token"] must be replaced
-/+ resource "github_actions_secret" "secrets" {
      ~ created_at      = "2024-03-14 15:14:45 +0000 UTC" -> (known after apply)
      ~ id              = "VXI-env:TF_VAR_gh_token" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-14 15:14:45 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.secrets["net.TF_VAR_gh_token"] must be replaced
-/+ resource "github_actions_secret" "secrets" {
      ~ created_at      = "2024-03-14 15:15:12 +0000 UTC" -> (known after apply)
      ~ id              = "VXI-Network:TF_VAR_gh_token" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-14 15:15:12 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.secrets["org.TF_VAR_gh_token"] must be replaced
-/+ resource "github_actions_secret" "secrets" {
      ~ created_at      = "2024-03-14 15:14:42 +0000 UTC" -> (known after apply)
      ~ id              = "VXI-Org:TF_VAR_gh_token" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-14 15:14:42 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.secrets["proj.TF_VAR_gh_token"] must be replaced
-/+ resource "github_actions_secret" "secrets" {
      ~ created_at      = "2024-03-14 15:14:41 +0000 UTC" -> (known after apply)
      ~ id              = "VXI-Projects:TF_VAR_gh_token" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-03-14 15:14:41 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.seed_bootstrap.data.google_storage_project_service_account.gcs_account will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_project_service_account" "gcs_account" {
      + email_address = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + project       = "prj-b-seed-365c"
    }

  # module.seed_bootstrap.google_organization_iam_binding.billing_creator will be updated in-place
  ~ resource "google_organization_iam_binding" "billing_creator" {
        id      = "1078592434138/roles/billing.creator"
      ~ members = [
          + "group:gcp-billing-admins@inlzgke1.joonix.net",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.seed_bootstrap.google_organization_iam_binding.project_creator[0] will be updated in-place
  ~ resource "google_organization_iam_binding" "project_creator" {
        id      = "1078592434138/roles/resourcemanager.projectCreator"
      ~ members = [
          + "group:gcp-organization-admins@inlzgke1.joonix.net",
          + "serviceAccount:sa-terraform-bootstrap@prj-b-seed-365c.iam.gserviceaccount.com",
          + "serviceAccount:sa-terraform-env@prj-b-seed-365c.iam.gserviceaccount.com",
          + "serviceAccount:sa-terraform-net@prj-b-seed-365c.iam.gserviceaccount.com",
          + "serviceAccount:sa-terraform-org@prj-b-seed-365c.iam.gserviceaccount.com",
          + "serviceAccount:sa-terraform-proj@prj-b-seed-365c.iam.gserviceaccount.com",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.seed_bootstrap.google_organization_iam_member.org_admin_serviceusage_consumer[0] will be created
  + resource "google_organization_iam_member" "org_admin_serviceusage_consumer" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:gcp-organization-admins@inlzgke1.joonix.net"
      + org_id = "1078592434138"
      + role   = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.seed_bootstrap.google_organization_iam_member.org_admins_group["roles/billing.user"] will be created
  + resource "google_organization_iam_member" "org_admins_group" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:gcp-organization-admins@inlzgke1.joonix.net"
      + org_id = "1078592434138"
      + role   = "roles/billing.user"
    }

  # module.seed_bootstrap.google_organization_iam_member.org_admins_group["roles/resourcemanager.organizationAdmin"] will be created
  + resource "google_organization_iam_member" "org_admins_group" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:gcp-organization-admins@inlzgke1.joonix.net"
      + org_id = "1078592434138"
      + role   = "roles/resourcemanager.organizationAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.org_billing_admin will be created
  + resource "google_organization_iam_member" "org_billing_admin" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:gcp-billing-admins@inlzgke1.joonix.net"
      + org_id = "1078592434138"
      + role   = "roles/billing.admin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tmp_project_creator[0] will be created
  + resource "google_organization_iam_member" "tmp_project_creator" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:gcp-organization-admins@inlzgke1.joonix.net"
      + org_id = "1078592434138"
      + role   = "roles/resourcemanager.projectCreator"
    }

  # module.seed_bootstrap.module.kms[0].google_kms_crypto_key_iam_binding.decrypters[0] will be updated in-place
  ~ resource "google_kms_crypto_key_iam_binding" "decrypters" {
        id            = "projects/prj-b-seed-365c/locations/us-central1/keyRings/prj-keyring/cryptoKeys/prj-key/roles/cloudkms.cryptoKeyDecrypter"
      ~ members       = [
          - "serviceAccount:service-725595940612@gs-project-accounts.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.seed_bootstrap.module.kms[0].google_kms_crypto_key_iam_binding.encrypters[0] will be updated in-place
  ~ resource "google_kms_crypto_key_iam_binding" "encrypters" {
        id            = "projects/prj-b-seed-365c/locations/us-central1/keyRings/prj-keyring/cryptoKeys/prj-key/roles/cloudkms.cryptoKeyEncrypter"
      ~ members       = [
          - "serviceAccount:service-725595940612@gs-project-accounts.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 10 to add, 4 to change, 4 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: module.seed_bootstrap.module.seed_project.module.project-factory.random_id.random_project_id_suffix: Refreshing state... [id=Nlw]%0Amodule.gh_cicd.module.project-factory.random_id.random_project_id_suffix: Refreshing state... [id=9U4]%0Amodule.seed_bootstrap.random_id.suffix: Refreshing state... [id=Gic]%0Agoogle_folder.bootstrap: Refreshing state... [id=folders/960529958502]%0Amodule.seed_bootstrap.google_organization_iam_member.org_admins_group["roles/billing.user"]: Refreshing state... [id=1078592434138/roles/billing.user/group:gcp-organization-admins@inlzgke1.joonix.net]%0Amodule.seed_bootstrap.google_organization_iam_binding.billing_creator: Refreshing state... [id=1078592434138/roles/billing.creator]%0Amodule.seed_bootstrap.google_organization_iam_member.org_billing_admin: Refreshing state... [id=1078592434138/roles/billing.admin/group:gcp-billing-admins@inlzgke1.joonix.net]%0Amodule.seed_bootstrap.google_organization_iam_member.org_admins_group["roles/resourcemanager.organizationAdmin"]: Refreshing state... [id=1078592434138/roles/resourcemanager.organizationAdmin/group:gcp-organization-admins@inlzgke1.joonix.net]%0Amodule.seed_bootstrap.google_organization_iam_member.org_admin_serviceusage_consumer[0]: Refreshing state... [id=1078592434138/roles/serviceusage.serviceUsageConsumer/group:gcp-organization-admins@inlzgke1.joonix.net]%0Amodule.seed_bootstrap.google_organization_iam_member.tmp_project_creator[0]: Refreshing state... [id=1078592434138/roles/resourcemanager.projectCreator/group:gcp-organization-admins@inlzgke1.joonix.net]%0Amodule.gh_cicd.module.project-factory.google_project.main: Refreshing state... [id=projects/prj-b-cicd-wif-gh-f54e]%0Amodule.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/serviceusage.googleapis.com]%0Amodule.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/compute.googleapis.com]%0Amodule.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/billingbudgets.googleapis.com]%0Amodule.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["admin.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/admin.googleapis.com]%0Amodule.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/cloudresourcemanager.googleapis.com]%0Amodule.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/iamcredentials.googleapis.com]%0Amodule.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["cloudbilling.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/cloudbilling.googleapis.com]%0Amodule.gh_cicd.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=prj-b-cicd-wif-gh-f54e/iam.googleapis.com]%0Amodule.gh_cicd.module.project-factory.google_service_account.default_service_account[0]: Refreshing state... [id=projects/prj-b-cicd-wif-gh-f54e/serviceAccounts/project-service-account@prj-b-cicd-wif-gh-f54e.iam.gserviceaccount.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.google_project.main: Refreshing state... [id=projects/prj-b-seed-365c]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.google_resource_manager_lien.lien[0]: Refreshing state... [id=p725595940612-la06c2b9e-ba2b-4986-95fd-c3f04e2cca09]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["essentialcontacts.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/essentialcontacts.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/compute.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/monitoring.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/iamcredentials.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/servicenetworking.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["accesscontextmanager.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/accesscontextmanager.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/cloudresourcemanager.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/billingbudgets.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/iam.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["securitycenter.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/securitycenter.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudasset.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/cloudasset.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["assuredworkloads.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/assuredworkloads.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/serviceusage.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["appengine.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/appengine.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["storage-api.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/storage-api.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["admin.googleapis.com"]: Refreshing state... [id=prj-b-seed-365c/admin.googleapis.com]%0Amodule.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing st ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/rishabh1dhakar/VXI-Bootstrap/actions/runs/8322536344">Actions</a>.<br /><br />
